MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM36BF10FG/mcu.h
#define TSB_DMAB_STATUS_MASTER_ENABLE             (*((__I  uint32_t *)BITBAND_PERI(&TSB_DMAB->STATUS,0)))
#define TSB_DMAB_CFG_MASTER_ENABLE                (*((__O  uint32_t *)BITBAND_PERI(&TSB_DMAB->CFG,0)))
#define TSB_DMAB_ERRCLR_ERR_CLR                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_DMAB->ERRCLR,0)))


/* Analog-to-Digital Converter (AD) */
#define TSB_AD_MOD0_ADS                           (*((__O  uint32_t *)BITBAND_PERI(&TSB_AD->MOD0,0)))
#define TSB_AD_MOD0_HPADS                         (*((__O  uint32_t *)BITBAND_PERI(&TSB_AD->MOD0,1)))
#define TSB_AD_MOD1_ADHWE                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD1,0)))
#define TSB_AD_MOD1_ADHWS                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD1,1)))
#define TSB_AD_MOD1_HPADHWE                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD1,2)))
#define TSB_AD_MOD1_HPADHWS                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD1,3)))
#define TSB_AD_MOD1_RCUT                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD1,5)))
#define TSB_AD_MOD1_I2AD                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD1,6)))
#define TSB_AD_MOD1_DACON                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD1,7)))
#define TSB_AD_MOD3_SCAN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD3,0)))
#define TSB_AD_MOD3_REPEAT                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->MOD3,1)))
#define TSB_AD_MOD5_ADBF                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->MOD5,0)))
#define TSB_AD_MOD5_EOCF                          (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->MOD5,1)))
#define TSB_AD_MOD5_HPADBF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->MOD5,2)))
#define TSB_AD_MOD5_HPEOCF                        (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->MOD5,3)))
#define TSB_AD_CMPCR0_ADBIG0                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->CMPCR0,4)))
#define TSB_AD_CMPCR0_CMPCOND0                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->CMPCR0,5)))
#define TSB_AD_CMPCR0_CMP0EN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->CMPCR0,7)))
#define TSB_AD_CMPCR1_ADBIG1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->CMPCR1,4)))
#define TSB_AD_CMPCR1_CMPCOND1                    (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->CMPCR1,5)))
#define TSB_AD_CMPCR1_CMP1EN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_AD->CMPCR1,7)))
#define TSB_AD_REG00_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG00,12)))
#define TSB_AD_REG00_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG00,13)))
#define TSB_AD_REG00_ADRF_MIR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG00,16)))
#define TSB_AD_REG00_ADOVRF_MIR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG00,17)))
#define TSB_AD_REG01_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG01,12)))
#define TSB_AD_REG01_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG01,13)))
#define TSB_AD_REG01_ADRF_MIR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG01,16)))
#define TSB_AD_REG01_ADOVRF_MIR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG01,17)))
#define TSB_AD_REG02_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG02,12)))
#define TSB_AD_REG02_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG02,13)))
#define TSB_AD_REG02_ADRF_MIR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG02,16)))
#define TSB_AD_REG02_ADOVRF_MIR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG02,17)))
#define TSB_AD_REG03_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG03,12)))
#define TSB_AD_REG03_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG03,13)))
#define TSB_AD_REG03_ADRF_MIR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG03,16)))
#define TSB_AD_REG03_ADOVRF_MIR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG03,17)))
#define TSB_AD_REG04_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG04,12)))
#define TSB_AD_REG04_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG04,13)))
#define TSB_AD_REG04_ADRF_MIR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG04,16)))
#define TSB_AD_REG04_ADOVRF_MIR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG04,17)))
#define TSB_AD_REG05_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG05,12)))
#define TSB_AD_REG05_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG05,13)))
#define TSB_AD_REG05_ADRF_MIR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG05,16)))
#define TSB_AD_REG05_ADOVRF_MIR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG05,17)))
#define TSB_AD_REG06_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG06,12)))
#define TSB_AD_REG06_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG06,13)))
#define TSB_AD_REG06_ADRF_MIR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG06,16)))
#define TSB_AD_REG06_ADOVRF_MIR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG06,17)))
#define TSB_AD_REG07_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG07,12)))
#define TSB_AD_REG07_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG07,13)))
#define TSB_AD_REG07_ADRF_MIR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG07,16)))
#define TSB_AD_REG07_ADOVRF_MIR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG07,17)))
#define TSB_AD_REG08_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG08,12)))
#define TSB_AD_REG08_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG08,13)))
#define TSB_AD_REG08_ADRF_MIR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG08,16)))
#define TSB_AD_REG08_ADOVRF_MIR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG08,17)))
#define TSB_AD_REG09_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG09,12)))
#define TSB_AD_REG09_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG09,13)))
#define TSB_AD_REG09_ADRF_MIR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG09,16)))
#define TSB_AD_REG09_ADOVRF_MIR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG09,17)))
#define TSB_AD_REG10_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG10,12)))
#define TSB_AD_REG10_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG10,13)))
#define TSB_AD_REG10_ADRF_MIR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG10,16)))
#define TSB_AD_REG10_ADOVRF_MIR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG10,17)))
#define TSB_AD_REG11_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG11,12)))
#define TSB_AD_REG11_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG11,13)))
#define TSB_AD_REG11_ADRF_MIR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG11,16)))
#define TSB_AD_REG11_ADOVRF_MIR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG11,17)))
#define TSB_AD_REG12_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG12,12)))
#define TSB_AD_REG12_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG12,13)))
#define TSB_AD_REG12_ADRF_MIR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG12,16)))
#define TSB_AD_REG12_ADOVRF_MIR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG12,17)))
#define TSB_AD_REG13_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG13,12)))
#define TSB_AD_REG13_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG13,13)))
#define TSB_AD_REG13_ADRF_MIR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG13,16)))
#define TSB_AD_REG13_ADOVRF_MIR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG13,17)))
#define TSB_AD_REG14_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG14,12)))
#define TSB_AD_REG14_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG14,13)))
#define TSB_AD_REG14_ADRF_MIR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG14,16)))
#define TSB_AD_REG14_ADOVRF_MIR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG14,17)))
#define TSB_AD_REG15_ADRF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG15,12)))
#define TSB_AD_REG15_ADOVRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG15,13)))
#define TSB_AD_REG15_ADRF_MIR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG15,16)))
#define TSB_AD_REG15_ADOVRF_MIR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REG15,17)))
#define TSB_AD_REGSP_ADSPRF                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REGSP,12)))
#define TSB_AD_REGSP_ADOVRSPF                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REGSP,13)))
#define TSB_AD_REGSP_ADSPRF_MIR                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REGSP,16)))
#define TSB_AD_REGSP_ADOVRSPF_MIR                 (*((__I  uint32_t *)BITBAND_PERI(&TSB_AD->REGSP,17)))


/* External Bus Interface(EXB) */
#define TSB_EXB_MOD_EXBSEL                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_EXB->MOD,0)))
#define TSB_EXB_CS0_CSW0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_EXB->CS0,0)))
#define TSB_EXB_CS0_CSW1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_EXB->CS0,1)))
#define TSB_EXB_CS0_CSW2                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_EXB->CS0,2)))
#define TSB_EXB_CS1_CSW0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_EXB->CS1,0)))
#define TSB_EXB_CS1_CSW1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_EXB->CS1,1)))
#define TSB_EXB_CS1_CSW2                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_EXB->CS1,2)))
#define TSB_EXB_CS2_CSW0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_EXB->CS2,0)))
#define TSB_EXB_CS2_CSW1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_EXB->CS2,1)))
#define TSB_EXB_CS2_CSW2                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_EXB->CS2,2)))
#define TSB_EXB_CS3_CSW0                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_EXB->CS3,0)))
#define TSB_EXB_CS3_CSW1                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_EXB->CS3,1)))
#define TSB_EXB_CS3_CSW2                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_EXB->CS3,2)))


