MikroElektronika/core_packages/ARM/gcc_clang/def/toshiba/TMPM36BF10FG/mcu.h
/* Remote Control Signal Preprocessor (RMC) */
#define TSB_RMC_EN_RMCEN                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC->EN,0)))
#define TSB_RMC_REN_RMCREN                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC->REN,0)))
#define TSB_RMC_RCR2_RMCPHM                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC->RCR2,24)))
#define TSB_RMC_RCR2_RMCLD                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC->RCR2,25)))
#define TSB_RMC_RCR2_RMCEDIEN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC->RCR2,30)))
#define TSB_RMC_RCR2_RMCLIEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC->RCR2,31)))
#define TSB_RMC_RCR4_RMCPO                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC->RCR4,7)))
#define TSB_RMC_RSTAT_RMCRLDR                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_RMC->RSTAT,7)))
#define TSB_RMC_RSTAT_RMCEDIF                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_RMC->RSTAT,12)))
#define TSB_RMC_RSTAT_RMCDMAXIF                   (*((__I  uint32_t *)BITBAND_PERI(&TSB_RMC->RSTAT,13)))
#define TSB_RMC_RSTAT_RMCLOIF                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_RMC->RSTAT,14)))
#define TSB_RMC_RSTAT_RMCRLIF                     (*((__I  uint32_t *)BITBAND_PERI(&TSB_RMC->RSTAT,15)))
#define TSB_RMC_FSSEL_RMCCLK                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_RMC->FSSEL,0)))


/* Oscillation Frequency Detector (OFD) */
#define TSB_OFD_RST_OFDRSTEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_OFD->RST,0)))
#define TSB_OFD_STAT_FRQERR                       (*((__I  uint32_t *)BITBAND_PERI(&TSB_OFD->STAT,0)))
#define TSB_OFD_STAT_OFDBUSY                      (*((__I  uint32_t *)BITBAND_PERI(&TSB_OFD->STAT,1)))
#define TSB_OFD_MON_OFDMON                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_OFD->MON,0)))


/* Watchdog Timer (WD) */
#define TSB_WD_MOD_RESCR                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_WD->MOD,1)))
#define TSB_WD_MOD_I2WDT                          (*((__IO uint32_t *)BITBAND_PERI(&TSB_WD->MOD,2)))
#define TSB_WD_MOD_WDTE                           (*((__IO uint32_t *)BITBAND_PERI(&TSB_WD->MOD,7)))


/* Clock Generator (CG) */
#define TSB_CG_SYSCR_FPSEL                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->SYSCR,12)))
#define TSB_CG_SYSCR_FCSTOP                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->SYSCR,20)))
#define TSB_CG_OSCCR_WUEON                        (*((__O  uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,0)))
#define TSB_CG_OSCCR_WUEF                         (*((__I  uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,1)))
#define TSB_CG_OSCCR_PLLON                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,2)))
#define TSB_CG_OSCCR_WUPSEL1                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,3)))
#define TSB_CG_OSCCR_XEN1                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,8)))
#define TSB_CG_OSCCR_XTEN                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,9)))
#define TSB_CG_OSCCR_XEN3                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,10)))
#define TSB_CG_OSCCR_XEN2                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,16)))
#define TSB_CG_OSCCR_OSCSEL                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,17)))
#define TSB_CG_OSCCR_EHOSCSEL                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,18)))
#define TSB_CG_OSCCR_WUPSEL2                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->OSCCR,19)))
#define TSB_CG_STBYCR_DRVE                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->STBYCR,16)))
#define TSB_CG_STBYCR_PTKEEP                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->STBYCR,17)))
#define TSB_CG_PLLSEL_PLLSEL                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->PLLSEL,0)))
#define TSB_CG_FSYSMSK_MSK0                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,0)))
#define TSB_CG_FSYSMSK_MSK1                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,1)))
#define TSB_CG_FSYSMSK_MSK2                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,2)))
#define TSB_CG_FSYSMSK_MSK3                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,3)))
#define TSB_CG_FSYSMSK_MSK4                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,4)))
#define TSB_CG_FSYSMSK_MSK5                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,5)))
#define TSB_CG_FSYSMSK_MSK6                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,6)))
#define TSB_CG_FSYSMSK_MSK7                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,7)))
#define TSB_CG_FSYSMSK_MSK8                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,8)))
#define TSB_CG_FSYSMSK_MSK9                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,9)))
#define TSB_CG_FSYSMSK_MSK10                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,10)))
#define TSB_CG_FSYSMSK_MSK11                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,11)))
#define TSB_CG_FSYSMSK_MSK12                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,12)))
#define TSB_CG_FSYSMSK_MSK13                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,13)))
#define TSB_CG_FSYSMSK_MSK14                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,14)))
#define TSB_CG_FSYSMSK_MSK15                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,15)))
#define TSB_CG_FSYSMSK_MSK16                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,16)))
#define TSB_CG_FSYSMSK_MSK17                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,17)))
#define TSB_CG_FSYSMSK_MSK18                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,18)))
#define TSB_CG_FSYSMSK_MSK19                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,19)))
#define TSB_CG_FSYSMSK_MSK20                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,20)))
#define TSB_CG_FSYSMSK_MSK21                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,21)))
#define TSB_CG_FSYSMSK_MSK22                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,22)))
#define TSB_CG_FSYSMSK_MSK23                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,23)))
#define TSB_CG_FSYSMSK_MSK24                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,24)))
#define TSB_CG_FSYSMSK_MSK25                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,25)))
#define TSB_CG_FSYSMSK_MSK26                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,26)))
#define TSB_CG_FSYSMSK_MSK27                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,27)))
#define TSB_CG_FSYSMSK_MSK28                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,28)))
#define TSB_CG_FSYSMSK_MSK29                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,29)))
#define TSB_CG_FSYSMSK_MSK30                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,30)))
#define TSB_CG_FSYSMSK_MSK31                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->FSYSMSK,31)))
#define TSB_CG_IMCGA_INT0EN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGA,0)))
#define TSB_CG_IMCGA_INT1EN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGA,8)))
#define TSB_CG_IMCGA_INT2EN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGA,16)))
#define TSB_CG_IMCGA_INT3EN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGA,24)))
#define TSB_CG_IMCGB_INT4EN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGB,0)))
#define TSB_CG_IMCGB_INT5EN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGB,8)))
#define TSB_CG_IMCGB_INT6EN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGB,16)))
#define TSB_CG_IMCGB_INT7EN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGB,24)))
#define TSB_CG_IMCGC_INT8EN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGC,0)))
#define TSB_CG_IMCGC_INT9EN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGC,8)))
#define TSB_CG_IMCGC_INTAEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGC,16)))
#define TSB_CG_IMCGC_INTBEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGC,24)))
#define TSB_CG_IMCGD_INTCEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGD,0)))
#define TSB_CG_IMCGD_INTDEN                       (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGD,8)))
#define TSB_CG_IMCGD_INTRTCEN                     (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGD,16)))
#define TSB_CG_IMCGD_INTRMCRXEN                   (*((__IO uint32_t *)BITBAND_PERI(&TSB_CG->IMCGD,24)))


/* Internal High-speed Oscillation Adjustment */
#define TSB_TRMOSC_EN_TRIMEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_TRMOSC->EN,0)))


/* Low Voltage detector control register */
#define TSB_LVD_RCR_LVDEN1                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_LVD->RCR,0)))
#define TSB_LVD_RCR_LVDRSTEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_LVD->RCR,5)))
#define TSB_LVD_ICR_LVDEN2                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_LVD->ICR,0)))
#define TSB_LVD_ICR_INTSEL                        (*((__IO uint32_t *)BITBAND_PERI(&TSB_LVD->ICR,4)))
#define TSB_LVD_ICR_LVDINTEN                      (*((__IO uint32_t *)BITBAND_PERI(&TSB_LVD->ICR,5)))
#define TSB_LVD_SR_LVDST1                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_LVD->SR,0)))
#define TSB_LVD_SR_LVDST2                         (*((__IO uint32_t *)BITBAND_PERI(&TSB_LVD->SR,1)))


